app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def show
    @user  = User.find(params[:id])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "encrypted_password", "salt") VALUES ('Gino Garcia', 'Ginogarcia@netzero.net', '2012-04-16 02:09:22.540898', '2012-04-16 02:09:22.540898', '6555218f5daf5fe4d7b5cfd4ea5c3e608c772dfb821ec9afb89e05c2dcc9f912', 'ae38f93080d6af4fa38f79f522301ef01fb87ef6302fafe629b87327e4c360dc')
---
  def create
    #raise params[:user].inspect
    @user = User.new(params[:user])
    if @user.save